Squantor/libMcu/svd/nxp/LPC11D14.svd
				</field>																				
			</fields>																					
		</register>																						
	</registers>																							
															
    </peripheral>
	<peripheral derivedFrom="CT32B0">
		<name>CT32B1</name>
		<baseAddress>0x40018000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0xFFF</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>CT32B1</name>
			<value>19</value>
		</interrupt>
	</peripheral>
	<peripheral>
	<name>ADC</name>
	<description>10-bit ADC</description>
	<groupName>ADC</groupName>
	<baseAddress>0x4001C000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0xFFF</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>ADC</name>
			<value>24</value>
		</interrupt>
	<registers>																							
		<register>																						
			<name>CR</name>																					
			<description>A/D Control Register. The ADCR register must be written to select the operating mode before A/D conversion can occur.</description>																					
			<addressOffset>0x000</addressOffset>																					
			<access>read-write</access>																					
			<resetValue>0x00000000</resetValue>																					
			<resetMask>0xFFFFFFFF</resetMask>																					
			<fields>																					
				<field>																				
					<name>SEL</name>																			
					<description>Selects which of the AD7:0 pins is (are) to be sampled and converted. Bit 0 selects Pin AD0, bit 1 selects pin AD1,..., and bit 7 selects pin AD7.  In software-controlled mode (BURST = 0), only one channel can be selected, i.e. only one of these bits should be 1.  In hardware scan mode (BURST = 1), any numbers of channels can be selected, i.e any or all bits can be set to 1. If all bits are set to 0, channel 0 is selected automatically (SEL = 0x01).</description>																			
					<bitRange>[7:0]</bitRange>																			
																	
				</field>																				
				<field>																				
					<name>CLKDIV</name>																			
					<description>The APB clock (PCLK) is divided by CLKDIV +1 to produce the clock for the ADC, which should be less than or equal to 4.5 MHz. Typically, software should program the smallest value in this field that yields a clock of 4.5 MHz or slightly less, but in certain cases (such as a high-impedance analog source) a slower clock may be desirable.</description>																			
					<bitRange>[15:8]</bitRange>																			
																	
				</field>																				
				<field>																				
					<name>BURST</name>																			
					<description>Burst mode</description>																			
					<bitRange>[16:16]</bitRange>																			
					<enumeratedValues>																			
					<name>test</name>																			
						<enumeratedValue>																		
							<name>SWMODE</name>																	
							<description>Software-controlled mode: Conversions are software-controlled and require 11 clocks.</description>																	
							<value>0</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>HWMODE</name>																	
							<description>Hardware scan mode: The AD converter does repeated conversions at the rate selected by the CLKS field, scanning (if necessary) through the pins selected by 1s in the SEL field. The first conversion after the start corresponds to the least-significant bit set to 1 in the SEL field, then the next higher  bits (pins) set to 1 are scanned if applicable. Repeated conversions can be terminated by clearing this bit, but the conversion in progress when this bit is cleared will be completed. Important: START bits must be 000 when BURST = 1 or conversions will not start.</description>																	
							<value>1</value>																	
						</enumeratedValue>																		
					</enumeratedValues>																			
				</field>																				
				<field>																				
					<name>CLKS</name>																			
					<description>This field selects the number of clocks used for each conversion in Burst mode, and the number of bits of accuracy of the result in the LS bits of ADDR, between 11 clocks (10 bits) and 4 clocks (3 bits).</description>																			
					<bitRange>[19:17]</bitRange>																			
					<enumeratedValues>																			
					<name>test</name>																			
						<enumeratedValue>																		
							<name>10BIT</name>																	
							<description>11 clocks / 10 bits</description>																	
							<value>0x0</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>9BIT</name>																	
							<description>10 clocks / 9 bits</description>																	
							<value>0x1</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>8BIT</name>																	
							<description>9 clocks / 8 bits</description>																	
							<value>0x2</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>7BIT</name>																	
							<description>8 clocks / 7 bits</description>																	
							<value>0x3</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>6BIT</name>																	
							<description>7 clocks / 6 bits</description>																	
							<value>0x4</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>5BIT</name>																	
							<description>6 clocks / 5 bits</description>																	
							<value>0x5</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>4BIT</name>																	
							<description>5 clocks / 4 bits</description>																	
							<value>0x6</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>3BIT</name>																	
							<description>4 clocks / 3 bits</description>																	
							<value>0x7</value>																	
						</enumeratedValue>																		
					</enumeratedValues>																			
				</field>																				
				<field>																				
					<name>RESERVED</name>																			
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>																			
					<bitRange>[23:20]</bitRange>																			
																	
